
/* General strings */

"OK" = "OK";

"Cancel" = "Cancel";

"Yes" = "Yes";

"No" = "No";

"Error" = "Error";


/* Expanded memory setting */

"Expanded Memory Question" = "Changing the memory expansion pack setting will reset the emulator. Do you want to change this setting now?";

"Change" = "Change";

"Don't Change" = "Don't Change";


/* Preferences */

"Preferences" = "Preferences";

"Emulation" = "Emulation";

"Graphics" = "Graphics";


/* Game freeze messages */

"Freeze Select Cartridge" = "Please locate the cartridge this game freeze was created with:";

"Freeze Restore Error" = "There was an error reading the game freeze.";

"Freeze Restore Version Error" = "The game freeze cannot be opened because it was created with a newer version of sixtyforce than this one.";

"Freeze Autosave Disable" = "You have loaded a game freeze. Do you want to disable autosaving?";

"Freeze Autosave Disable Detail" = "Warning: If autosaving is enabled, any saved game stored in the game freeze will replace any autosaved game you have. Autosaving will be disabled until you load a new cartridge.";

"Freeze Autosave Disable Button" = "Disable Autosave";

"Freeze Autosave Enable Button" = "Enable Autosave";

"Freeze Default Filename" = "Untitled Game Freeze";


/* Registration messages */

"Registration Welcome" = "Welcome to sixtyforce!";

"Registration Welcome Detail" = "Like sixtyforce? Please register! When you register you'll get autosaving, game freezes and the 'sixtyforce' logo won't appear over your game. Click 'Register Now' and you can have a serial number emailed you to instantly!";

"Registration Try Button" = "OK";

"Registration Buy Button" = "Register Now";

"Registration Save Notice" = "If you register sixtyforce you will be able to save games. Would you like to register now?";

"Registration Future" = "This registration appears to be for a newer version of sixtyforce. ";

"Registration Future Detail" = "Please enter everything exactly as it appears in your registration confirmation email and try again. You should also check the sixtyforce.com website to see if a newer version is available.";

"Registration Invalid" = "Invalid Registration";

"Registration Invalid Detail" = "There is an error with the registration you entered. Please enter everything exactly as it appears in your registration confirmation email and try again.";

"Registration Blacklisted" = "Please don't pirate sixtyforce.";

"Registration Blacklisted Detail" = "If you don't think sixtyforce is worth it, just use a free alternative. Otherwise please reward hard work. If you think it's worth using, it's worth paying for.";


/* Error messages */

"Error OpenGL Setup" = "There was an error preparing OpenGL.";

"Error OpenGL Setup Detail" = "This error may be because your computer does not support OpenGL 3.2.";

"Error Opening File" = "There was an error opening the file.";

"Error Saving File" = "There was an error saving the file.";

"Error Emulator Crashed" = "The software being emulated appears to have crashed.";

"Error Loading Cartridge" = "There was an error loading the cartridge.";

"Error Loading Cartridge Format" = "The cartridge could not be loaded because it is in a format sixtyforce can't use.";

"Error Resetting" = "There was an error resetting sixtyforce.";

"Error Starting" = "There was an error starting sixtyforce.";

"Error Starting Audio" = "There was an error starting audio output. Sound will be disabled.";


/* Warning messages */

"Warning Rosetta" = "sixtyforce is not optimized for this Mac.";

"Warning Rosetta Detail" = "This version of sixtyforce was not designed for Apple Silicon and may have performance problems on your Mac.\n\nPlease check the sixtyforce website for more information.";

"Warning Rosetta Website Button" = "More Information...";


/* Controller messages */

"Controller Configure Header" = "%@ Configuration:";

"Controller Delete OK Button" = "Delete";

"Controller Delete Cancel Button" = "Don't Delete";

"Controller Device Generic Bluetooth Name" = "Bluetooth Controller";

"Controller Device Generic Name" = "USB Controller";

"Controller Enable Configure" = "'%@' needs to be configured before you can use it. Would you like to configure it now?";

"Controller Enable Configure OK Button" = "Configure";

"Controller Enable Configure Cancel Button" = "Don't Configure";

"Controller HID Generic Element" = "Element";

"Controller Keyboard" = "Keyboard";

"Controller Mapping Default Name" = "Default";

"Controller Mapping Delete" = "Are you sure you want to delete the configuration '%@'?";

"Controller Mapping New Name" = "Untitled";


/* Configure controller */

"Configure Window Title" = "Configure \"%@\"";

"Configure Keyboard Help" = "Click on a controller button in the list to set its keyboard key.";

"Configure Keyboard Control Help" = "Press the key on the keyboard you want to use as the %@.";

"Configure HID Help" = "Click on a controller button in the list to set that control for your gamepad or controller.";

"Configure HID Device Help" = "Click on a controller button in the list to set that control for your %@.";

"Configure HID Control Help" = "Press a button or push a joystick in the direction you want to use as the %@.";

"Configure Unmapped Control" = "( not set )";


/* General interface */

"About Version" = "Version %@";

"About Register" = "Please register to support sixtyforce!";

"About Registered" = "Registered To: %@";

"Controller-Button-A" = "A Button";

"Controller-Button-B" = "B Button";

"Controller-Button-C-Down" = "C-Down";

"Controller-Button-C-Up" = "C-Up";

"Controller-Button-C-Left" = "C-Left";

"Controller-Button-C-Right" = "C-Right";

"Controller-Button-D-Down" = "D-Down";

"Controller-Button-D-Up" = "D-Up";

"Controller-Button-D-Left" = "D-Left";

"Controller-Button-D-Right" = "D-Right";

"Controller-Button-L" = "L Button";

"Controller-Button-R" = "R Button";

"Controller-Button-Z" = "Z Button";

"Controller-Button-sixtyforce" = "sixtyforce Button";

"Controller-Button-Start" = "Start Button";

"Controller-Stick-Up" = "Stick-Up";

"Controller-Stick-Down" = "Stick-Down";

"Controller-Stick-Left" = "Stick-Left";

"Controller-Stick-Right" = "Stick-Right";

"Freeze" = "Freeze";

"Menu Switch Memory Pack" = "Switch Controller to Memory Pack";

"Menu Switch Rumble Pack" = "Switch Controller to Rumble Pack";

"Menu Enter Full Screen" = "Enter Full Screen";

"Menu Exit Full Screen" = "Exit Full Screen";

"Recording Default Filename" = "Recording %@ at %@";


/* Controller configuration help */

"Controller-Help-Button-A" = "A button";

"Controller-Help-Button-B" = "B button";

"Controller-Help-Button-Z" = "Z button";

"Controller-Help-Button-R" = "R button";

"Controller-Help-Button-L" = "L button";

"Controller-Help-Button-Start" = "Start button";

"Controller-Help-Button-C-Up" = "C-Up button";

"Controller-Help-Button-C-Down" = "C-Down button";

"Controller-Help-Button-C-Left" = "C-Left button";

"Controller-Help-Button-C-Right" = "C-Right button";

"Controller-Help-Button-D-Up" = "D-Pad Up";

"Controller-Help-Button-D-Down" = "D-Pad Down";

"Controller-Help-Button-D-Left" = "D-Pad Left";

"Controller-Help-Button-D-Right" = "D-Pad Right";

"Controller-Help-Stick-Up" = "joystick up";

"Controller-Help-Stick-Down" = "joystick down";

"Controller-Help-Stick-Left" = "joystick left";

"Controller-Help-Stick-Right" = "joystick right";


/* Update messages */

"Update Detail Header" = "Version %@";

"Update Latest Version" = "sixtyforce is up to date.";

"Update Latest Version Detail" = "Thank you for running the latest version of sixtyforce!";

"Update Not Compatible" = "You have the newest version of sixtyforce that is compatible with this Mac.";

"Update Not Compatible Detail" = "Visit sixtyforce.com to get more information about the latest version.";

"Update Error" = "There was an error updating sixtyforce.";

"Update Error Detail" = "Please visit sixtyforce.com to download the newest version of sixtyforce.";

"Update Error Download" = "There was an error downloading the update.";

"Update Error Extract" = "There was an error extracting the downloaded update.";

"Update Error File" = "There was an error with an update file.";

"Update Error File Move" = "There was an error moving an update file.";

"Update Error Loading" = "There was an error connecting to the internet to check for updates.";

"Update Error Loading Detail" = "Please visit sixtyforce.com to find out more about the latest version of sixtyforce.";

"Update Error Remove Existing" = "There was an error removing the current version of sixtyforce.";

"Update Error Validate" = "There was an error validating the downloaded update.";

"Update Maybe Later" = "Maybe Later";


/* Install messages */

"Install Error Copy" = "There was an error copying sixtyforce. Please install the new version using the Finder.";

"Install Error Remove" = "There was an error removing the old version of sixtyforce. Please install the new version using the Finder.";

"Install Update Existing" = "An older version of sixtyforce is installed in your Applications folder. Would you like to update it with this new version?";

"Install Update OK" = "Update";

"Install Update Cancel" = "Don't Update";
